cfd/curved_12_fine/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
convertToMeters 1;
vertices (
(0.023 -0.128 0)
(0.111 -0.04 0)
(0.008 -0.08 0)
(0.066 -0.028 0)
(0.004 -0.035 0)
(0.042 -0.01 0)
(0.004 0.002 0)
(0.04 0.002 0)
(0.004 0.04 0)
(0.04 0.04 0)
(0.004 0.1 0)
(0.04 0.1 0)
(0.004 0.156 0)
(0.04 0.156 0)
(0.004 0.192 0)
(0.04 0.192 0)
(0.004 0.198 0)
(0.04 0.198 0)
(0.0211429 0.218 0)
(0.038 0.218 0)
(0.0245714 0.222 0)
(0.038 0.222 0)
(0.0262857 0.224 0)
(0.04 0.224 0)
(0.028 0.226 0)
(0.04 0.226 0)
(0.028 0.232 0)
(0.04 0.232 0)
(0.023 -0.128 0.001)
(0.111 -0.04 0.001)
(0.008 -0.08 0.001)
(0.066 -0.028 0.001)
(0.004 -0.035 0.001)
(0.042 -0.01 0.001)
(0.004 0.002 0.001)
(0.04 0.002 0.001)
(0.004 0.04 0.001)
(0.04 0.04 0.001)
(0.004 0.1 0.001)
(0.04 0.1 0.001)
(0.004 0.156 0.001)
(0.04 0.156 0.001)
(0.004 0.192 0.001)
(0.04 0.192 0.001)
(0.004 0.198 0.001)
(0.04 0.198 0.001)
(0.0211429 0.218 0.001)
(0.038 0.218 0.001)
(0.0245714 0.222 0.001)
(0.038 0.222 0.001)
(0.0262857 0.224 0.001)
(0.04 0.224 0.001)
(0.028 0.226 0.001)
(0.04 0.226 0.001)
(0.028 0.232 0.001)
(0.04 0.232 0.001));
blocks (
hex (0 1 3 2 28 29 31 30) (42 57 1) simpleGrading (1 1 1)
hex (2 3 5 4 30 31 33 32) (42 44 1) simpleGrading (1 1 1)
hex (4 5 7 6 32 33 35 34) (42 29 1) simpleGrading (1 1 1)
hex (6 7 9 8 34 35 37 36) (42 45 1) simpleGrading (1 1 1)
hex (8 9 11 10 36 37 39 38) (42 71 1) simpleGrading (1 1 1)
hex (10 11 13 12 38 39 41 40) (42 66 1) simpleGrading (1 1 1)
hex (12 13 15 14 40 41 43 42) (42 42 1) simpleGrading (1 1 1)
hex (14 15 17 16 42 43 45 44) (42 7 1) simpleGrading (1 1 1)
hex (16 17 19 18 44 45 47 46) (42 27 1) simpleGrading (1 1 1)
hex (18 19 21 20 46 47 49 48) (42 5 1) simpleGrading (1 1 1)
hex (20 21 23 22 48 49 51 50) (42 3 1) simpleGrading (1 1 1)
hex (22 23 25 24 50 51 53 52) (42 3 1) simpleGrading (1 1 1)
hex (24 25 27 26 52 53 55 54) (42 7 1) simpleGrading (1 1 1));
edges ();
boundary (
walls { type wall; faces ( (0 2 30 28)
(1 29 31 3)
(2 4 32 30)
(3 31 33 5)
(4 6 34 32)
(5 33 35 7)
(6 8 36 34)
(7 35 37 9)
(8 10 38 36)
(9 37 39 11)
(10 12 40 38)
(11 39 41 13)
(12 14 42 40)
(14 16 44 42)
(15 43 45 17)
(16 18 46 44)
(17 45 47 19)
(18 20 48 46)
(19 47 49 21)
(20 22 50 48)
(21 49 51 23)
(22 24 52 50)
(23 51 53 25)
(24 26 54 52)
(25 53 55 27) ); }
laptopVent { type patch; faces ( (13 41 43 15) ); }
fanInlet { type patch; faces ( (0 28 29 1) ); }
slotOutlet { type patch; faces ( (26 27 55 54) ); }
frontBack { type empty; faces ( (0 1 3 2)
(28 30 31 29)
(2 3 5 4)
(30 32 33 31)
(4 5 7 6)
(32 34 35 33)
(6 7 9 8)
(34 36 37 35)
(8 9 11 10)
(36 38 39 37)
(10 11 13 12)
(38 40 41 39)
(12 13 15 14)
(40 42 43 41)
(14 15 17 16)
(42 44 45 43)
(16 17 19 18)
(44 46 47 45)
(18 19 21 20)
(46 48 49 47)
(20 21 23 22)
(48 50 51 49)
(22 23 25 24)
(50 52 53 51)
(24 25 27 26)
(52 54 55 53) ); });
mergePatchPairs ();
